Repository: cjmach/checksum
Catalog: Properties/Resources.*.resx
Languages: pt_pt

# RootCommandDescription
source: Print or check hash checksums.
pt_pt: Imprime ou verifica hash checksums.

# PrintCommandDescription
source: Print hash checksums.
pt_pt: Imprime hash checksums.

# CheckCommandDescription
source: Read hash sums from the FILEs and check them.
pt_pt: Lê hash checksums a partir de FILEs e verifica se correspondem.

# AlgorithmOptionDescription
source: The hash algorithm implementation to use. Supported values: sha, sha1, md5, sha256, sha384, sha512.
pt_pt: O nome do algoritmo de hash a usar. Valores suportados: sha, sha1, md5, sha256, sha384, sha512.

# FilesArgumentDescription
source: A list of files to process. If the list is empty (or first FILE is -), data is read from standard input.
pt_pt: Uma lista de ficheiros a processar. Se a lista estiver vazia (ou se o primeiro FILE é -), os dados são lidos do stdin.

# IOFileError
source: [ERROR] Failed to process {0}: {1}
pt_pt: [ERROR] Falha ao processar {0}: {1}

# InvalidHashAlgorithmError
source: [ERROR] Not a valid hash algorithm: {0}
pt_pt: [ERROR] Algoritmo de hash inválido: {0}

# InvalidHashStringError
source: [ERROR] Unexpected data format: invalid hash string.
pt_pt: [ERROR] Formato de dados inválido: hash inválida.

# InvalidModeError
source: [ERROR] Unexpected data format: invalid mode.
pt_pt: [ERROR] Formato de dados inválido: modo inválido.

# InvalidFileNameError
source: [ERROR] Unexpected data format: invalid file name.
pt_pt: [ERROR] Formato de dados inválido: nome de ficheiro inválido.

# InvalidChecksumStringError
source: [ERROR] Unexpected data format: invalid checksum string.
pt_pt: [ERROR] Formato de dados inválido: string de checksum inválida.

# VerifySuccessMessage
source: {0}: OK
pt_pt: {0}: Sucesso

# VerifyFailedMessage
source: {0}: Failed
pt_pt: {0}: Falha
